socialNetwork/wrk2/user-timeline-without-istio/COMMAND_10/30
Running 1m test @ http://localhost:31111/wrk2-api/post/compose
  8 threads and 16 connections
  Thread calibration: mean lat.: 2649.495ms, rate sampling interval: 11681ms
  Thread calibration: mean lat.: 2675.566ms, rate sampling interval: 11657ms
  Thread calibration: mean lat.: 2613.477ms, rate sampling interval: 11591ms
  Thread calibration: mean lat.: 2673.401ms, rate sampling interval: 11739ms
  Thread calibration: mean lat.: 2640.884ms, rate sampling interval: 11624ms
  Thread calibration: mean lat.: 2631.627ms, rate sampling interval: 11591ms
  Thread calibration: mean lat.: 2739.650ms, rate sampling interval: 11722ms
  Thread calibration: mean lat.: 2715.649ms, rate sampling interval: 11796ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     9.13s     1.50s   13.90s    69.05%
    Req/Sec    43.97      3.62    50.00     62.50%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.04s 
 75.000%   10.04s 
 90.000%   11.01s 
 99.000%   13.90s 
 99.900%   14.39s 
 99.990%   14.57s 
 99.999%   14.61s 
100.000%   14.61s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    5767.167     0.000000            1         1.00
    7319.551     0.100000         1712         1.11
    7815.167     0.200000         3424         1.25
    8265.727     0.300000         5140         1.43
    8658.943     0.400000         6861         1.67
    9035.775     0.500000         8590         2.00
    9224.191     0.550000         9425         2.22
    9379.839     0.600000        10306         2.50
    9535.487     0.650000        11123         2.86
    9740.287     0.700000        11975         3.33
   10035.199     0.750000        12846         4.00
   10182.655     0.775000        13271         4.44
   10321.919     0.800000        13692         5.00
   10461.183     0.825000        14110         5.71
   10633.215     0.850000        14542         6.67
   10821.631     0.875000        14979         8.00
   10919.935     0.887500        15195         8.89
   11010.047     0.900000        15396        10.00
   11108.351     0.912500        15620        11.43
   11190.271     0.925000        15823        13.33
   11313.151     0.937500        16043        16.00
   11378.687     0.943750        16147        17.78
   11460.607     0.950000        16259        20.00
   11591.679     0.956250        16359        22.86
   11739.135     0.962500        16467        26.67
   12058.623     0.968750        16569        32.00
   12754.943     0.971875        16623        35.56
   13197.311     0.975000        16678        40.00
   13418.495     0.978125        16730        45.71
   13582.335     0.981250        16784        53.33
   13705.215     0.984375        16840        64.00
   13762.559     0.985938        16863        71.11
   13819.903     0.987500        16893        80.00
   13869.055     0.989062        16917        91.43
   13918.207     0.990625        16943       106.67
   13975.551     0.992188        16971       128.00
   14016.511     0.992969        16983       142.22
   14082.047     0.993750        17000       160.00
   14106.623     0.994531        17012       182.86
   14131.199     0.995313        17023       213.33
   14163.967     0.996094        17037       256.00
   14188.543     0.996484        17044       284.44
   14221.311     0.996875        17051       320.00
   14262.271     0.997266        17057       365.71
   14295.039     0.997656        17064       426.67
   14327.807     0.998047        17070       512.00
   14335.999     0.998242        17073       568.89
   14352.383     0.998437        17077       640.00
   14360.575     0.998633        17081       731.43
   14376.959     0.998828        17084       853.33
   14401.535     0.999023        17087      1024.00
   14409.727     0.999121        17088      1137.78
   14417.919     0.999219        17090      1280.00
   14450.687     0.999316        17092      1462.86
   14475.263     0.999414        17093      1706.67
   14499.839     0.999512        17095      2048.00
   14516.223     0.999561        17097      2275.56
   14516.223     0.999609        17097      2560.00
   14532.607     0.999658        17098      2925.71
   14532.607     0.999707        17098      3413.33
   14540.799     0.999756        17099      4096.00
   14557.183     0.999780        17100      4551.11
   14557.183     0.999805        17100      5120.00
   14573.567     0.999829        17101      5851.43
   14573.567     0.999854        17101      6826.67
   14573.567     0.999878        17101      8192.00
   14598.143     0.999890        17102      9102.22
   14598.143     0.999902        17102     10240.00
   14598.143     0.999915        17102     11702.86
   14598.143     0.999927        17102     13653.33
   14598.143     0.999939        17102     16384.00
   14614.527     0.999945        17103     18204.44
   14614.527     1.000000        17103          inf
#[Mean    =     9126.164, StdDeviation   =     1498.178]
#[Max     =    14606.336, Total count    =        17103]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  19942 requests in 1.00m, 4.09MB read
  Socket errors: connect 0, read 0, write 0, timeout 41
Requests/sec:    332.36
Transfer/sec:     69.78KB